autoscaling/loadtest/results/11-커넥션풀/2026-08-18-connpool-partial-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/minchae/sources/yogurtte-rca-agent/autoscaling/loadtest/conn-pool-limit.js
        output: -

     scenarios: (100.00%) 1 scenario, 400 max VUs, 11m0s max duration (incl. graceful stop):
              * default: Up to 400 looping VUs for 10m30s over 6 stages (gracefulRampDown: 30s, gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

Run       [ 100% ] setup()
default   [   0% ]

running (00m17.0s), 001/400 VUs, 1 complete and 0 interrupted iterations
default   [   0% ] 001/400 VUs  00m00.5s/10m30.0s

running (00m18.0s), 001/400 VUs, 5 complete and 0 interrupted iterations
default   [   0% ] 001/400 VUs  00m01.5s/10m30.0s

running (00m19.0s), 001/400 VUs, 9 complete and 0 interrupted iterations
default   [   0% ] 001/400 VUs  00m02.5s/10m30.0s

running (00m20.0s), 001/400 VUs, 13 complete and 0 interrupted iterations
default   [   1% ] 001/400 VUs  00m03.5s/10m30.0s

running (00m21.0s), 001/400 VUs, 17 complete and 0 interrupted iterations
default   [   1% ] 001/400 VUs  00m04.5s/10m30.0s

running (00m22.0s), 001/400 VUs, 21 complete and 0 interrupted iterations
default   [   1% ] 001/400 VUs  00m05.5s/10m30.0s

running (00m23.0s), 002/400 VUs, 26 complete and 0 interrupted iterations
default   [   1% ] 002/400 VUs  00m06.5s/10m30.0s

running (00m24.0s), 002/400 VUs, 34 complete and 0 interrupted iterations
default   [   1% ] 002/400 VUs  00m07.5s/10m30.0s

running (00m25.0s), 002/400 VUs, 42 complete and 0 interrupted iterations
default   [   1% ] 002/400 VUs  00m08.5s/10m30.0s

running (00m26.0s), 002/400 VUs, 50 complete and 0 interrupted iterations
default   [   2% ] 002/400 VUs  00m09.5s/10m30.0s

running (00m27.0s), 002/400 VUs, 58 complete and 0 interrupted iterations
default   [   2% ] 002/400 VUs  00m10.5s/10m30.0s

running (00m28.0s), 002/400 VUs, 67 complete and 0 interrupted iterations
default   [   2% ] 002/400 VUs  00m11.5s/10m30.0s

running (00m29.0s), 002/400 VUs, 75 complete and 0 interrupted iterations
default   [   2% ] 002/400 VUs  00m12.5s/10m30.0s

running (00m30.0s), 003/400 VUs, 86 complete and 0 interrupted iterations
default   [   2% ] 003/400 VUs  00m13.5s/10m30.0s

running (00m31.0s), 003/400 VUs, 98 complete and 0 interrupted iterations
default   [   2% ] 003/400 VUs  00m14.5s/10m30.0s

running (00m32.0s), 003/400 VUs, 110 complete and 0 interrupted iterations
default   [   2% ] 003/400 VUs  00m15.5s/10m30.0s

running (00m33.0s), 003/400 VUs, 122 complete and 0 interrupted iterations
default   [   3% ] 003/400 VUs  00m16.5s/10m30.0s

running (00m34.0s), 003/400 VUs, 134 complete and 0 interrupted iterations
default   [   3% ] 003/400 VUs  00m17.5s/10m30.0s

running (00m35.0s), 003/400 VUs, 147 complete and 0 interrupted iterations
default   [   3% ] 003/400 VUs  00m18.5s/10m30.0s

running (00m36.0s), 004/400 VUs, 161 complete and 0 interrupted iterations
default   [   3% ] 004/400 VUs  00m19.5s/10m30.0s

running (00m37.0s), 004/400 VUs, 177 complete and 0 interrupted iterations
default   [   3% ] 004/400 VUs  00m20.5s/10m30.0s

running (00m38.0s), 004/400 VUs, 193 complete and 0 interrupted iterations
default   [   3% ] 004/400 VUs  00m21.5s/10m30.0s

running (00m39.0s), 004/400 VUs, 209 complete and 0 interrupted iterations
default   [   4% ] 004/400 VUs  00m22.5s/10m30.0s

running (00m40.0s), 004/400 VUs, 226 complete and 0 interrupted iterations
default   [   4% ] 004/400 VUs  00m23.5s/10m30.0s

running (00m41.0s), 004/400 VUs, 242 complete and 0 interrupted iterations
default   [   4% ] 004/400 VUs  00m24.5s/10m30.0s

running (00m42.0s), 005/400 VUs, 259 complete and 0 interrupted iterations
default   [   4% ] 005/400 VUs  00m25.5s/10m30.0s

running (00m43.0s), 005/400 VUs, 278 complete and 0 interrupted iterations
default   [   4% ] 005/400 VUs  00m26.5s/10m30.0s

running (00m44.0s), 005/400 VUs, 299 complete and 0 interrupted iterations
default   [   4% ] 005/400 VUs  00m27.5s/10m30.0s

running (00m45.0s), 005/400 VUs, 320 complete and 0 interrupted iterations
default   [   5% ] 005/400 VUs  00m28.5s/10m30.0s

running (00m46.0s), 005/400 VUs, 341 complete and 0 interrupted iterations
default   [   5% ] 005/400 VUs  00m29.5s/10m30.0s

running (00m47.0s), 005/400 VUs, 361 complete and 0 interrupted iterations
default   [   5% ] 005/400 VUs  00m30.5s/10m30.0s

running (00m48.0s), 005/400 VUs, 382 complete and 0 interrupted iterations
default   [   5% ] 005/400 VUs  00m31.5s/10m30.0s

running (00m49.0s), 006/400 VUs, 405 complete and 0 interrupted iterations
default   [   5% ] 006/400 VUs  00m32.5s/10m30.0s

running (00m50.0s), 006/400 VUs, 429 complete and 0 interrupted iterations
default   [   5% ] 006/400 VUs  00m33.5s/10m30.0s

running (00m51.0s), 006/400 VUs, 453 complete and 0 interrupted iterations
default   [   5% ] 006/400 VUs  00m34.5s/10m30.0s

running (00m52.0s), 006/400 VUs, 478 complete and 0 interrupted iterations
default   [   6% ] 006/400 VUs  00m35.5s/10m30.0s

running (00m53.0s), 006/400 VUs, 503 complete and 0 interrupted iterations
default   [   6% ] 006/400 VUs  00m36.5s/10m30.0s

running (00m54.0s), 006/400 VUs, 528 complete and 0 interrupted iterations
default   [   6% ] 006/400 VUs  00m37.5s/10m30.0s

running (00m55.0s), 007/400 VUs, 554 complete and 0 interrupted iterations
default   [   6% ] 007/400 VUs  00m38.5s/10m30.0s

running (00m56.0s), 007/400 VUs, 583 complete and 0 interrupted iterations
default   [   6% ] 007/400 VUs  00m39.5s/10m30.0s

running (00m57.0s), 007/400 VUs, 610 complete and 0 interrupted iterations
default   [   6% ] 007/400 VUs  00m40.5s/10m30.0s

running (00m58.0s), 007/400 VUs, 638 complete and 0 interrupted iterations
default   [   7% ] 007/400 VUs  00m41.5s/10m30.0s

running (00m59.0s), 007/400 VUs, 666 complete and 0 interrupted iterations
default   [   7% ] 007/400 VUs  00m42.5s/10m30.0s

running (01m00.0s), 007/400 VUs, 693 complete and 0 interrupted iterations
default   [   7% ] 007/400 VUs  00m43.5s/10m30.0s

running (01m01.0s), 008/400 VUs, 723 complete and 0 interrupted iterations
default   [   7% ] 008/400 VUs  00m44.5s/10m30.0s

running (01m02.0s), 008/400 VUs, 755 complete and 0 interrupted iterations
default   [   7% ] 008/400 VUs  00m45.5s/10m30.0s

running (01m03.0s), 008/400 VUs, 789 complete and 0 interrupted iterations
default   [   7% ] 008/400 VUs  00m46.5s/10m30.0s

running (01m04.0s), 008/400 VUs, 823 complete and 0 interrupted iterations
default   [   8% ] 008/400 VUs  00m47.5s/10m30.0s

running (01m05.0s), 008/400 VUs, 855 complete and 0 interrupted iterations
default   [   8% ] 008/400 VUs  00m48.5s/10m30.0s

running (01m06.0s), 008/400 VUs, 887 complete and 0 interrupted iterations
default   [   8% ] 008/400 VUs  00m49.5s/10m30.0s

running (01m07.0s), 008/400 VUs, 919 complete and 0 interrupted iterations
default   [   8% ] 008/400 VUs  00m50.5s/10m30.0s

running (01m08.0s), 009/400 VUs, 952 complete and 0 interrupted iterations
default   [   8% ] 009/400 VUs  00m51.5s/10m30.0s

running (01m09.0s), 009/400 VUs, 987 complete and 0 interrupted iterations
default   [   8% ] 009/400 VUs  00m52.5s/10m30.0s

running (01m10.0s), 009/400 VUs, 1015 complete and 0 interrupted iterations
default   [   8% ] 009/400 VUs  00m53.5s/10m30.0s

running (01m11.0s), 009/400 VUs, 1049 complete and 0 interrupted iterations
default   [   9% ] 009/400 VUs  00m54.5s/10m30.0s

running (01m12.0s), 009/400 VUs, 1085 complete and 0 interrupted iterations
default   [   9% ] 009/400 VUs  00m55.5s/10m30.0s

running (01m13.0s), 009/400 VUs, 1121 complete and 0 interrupted iterations
default   [   9% ] 009/400 VUs  00m56.5s/10m30.0s

running (01m14.0s), 010/400 VUs, 1159 complete and 0 interrupted iterations
default   [   9% ] 010/400 VUs  00m57.5s/10m30.0s

running (01m15.0s), 010/400 VUs, 1199 complete and 0 interrupted iterations
default   [   9% ] 010/400 VUs  00m58.5s/10m30.0s

running (01m16.0s), 010/400 VUs, 1241 complete and 0 interrupted iterations
default   [   9% ] 010/400 VUs  00m59.5s/10m30.0s

running (01m17.0s), 010/400 VUs, 1283 complete and 0 interrupted iterations
default   [  10% ] 010/400 VUs  01m00.5s/10m30.0s

running (01m18.0s), 010/400 VUs, 1324 complete and 0 interrupted iterations
default   [  10% ] 010/400 VUs  01m01.5s/10m30.0s

running (01m19.0s), 010/400 VUs, 1365 complete and 0 interrupted iterations
default   [  10% ] 010/400 VUs  01m02.5s/10m30.0s

running (01m20.0s), 011/400 VUs, 1408 complete and 0 interrupted iterations
default   [  10% ] 011/400 VUs  01m03.5s/10m30.0s

running (01m21.0s), 011/400 VUs, 1452 complete and 0 interrupted iterations
default   [  10% ] 011/400 VUs  01m04.5s/10m30.0s

running (01m22.0s), 011/400 VUs, 1497 complete and 0 interrupted iterations
default   [  10% ] 011/400 VUs  01m05.5s/10m30.0s

running (01m23.0s), 011/400 VUs, 1541 complete and 0 interrupted iterations
default   [  11% ] 011/400 VUs  01m06.5s/10m30.0s

running (01m24.0s), 011/400 VUs, 1585 complete and 0 interrupted iterations
default   [  11% ] 011/400 VUs  01m07.5s/10m30.0s

running (01m25.0s), 011/400 VUs, 1630 complete and 0 interrupted iterations
default   [  11% ] 011/400 VUs  01m08.5s/10m30.0s

running (01m26.0s), 012/400 VUs, 1675 complete and 0 interrupted iterations
default   [  11% ] 012/400 VUs  01m09.5s/10m30.0s

running (01m27.0s), 012/400 VUs, 1723 complete and 0 interrupted iterations
default   [  11% ] 012/400 VUs  01m10.5s/10m30.0s

running (01m28.0s), 012/400 VUs, 1771 complete and 0 interrupted iterations
default   [  11% ] 012/400 VUs  01m11.5s/10m30.0s

running (01m29.0s), 012/400 VUs, 1821 complete and 0 interrupted iterations
default   [  12% ] 012/400 VUs  01m12.5s/10m30.0s

running (01m30.0s), 012/400 VUs, 1870 complete and 0 interrupted iterations
default   [  12% ] 012/400 VUs  01m13.5s/10m30.0s

running (01m31.0s), 012/400 VUs, 1921 complete and 0 interrupted iterations
default   [  12% ] 012/400 VUs  01m14.5s/10m30.0s

running (01m32.0s), 012/400 VUs, 1969 complete and 0 interrupted iterations
default   [  12% ] 012/400 VUs  01m15.5s/10m30.0s

running (01m33.0s), 013/400 VUs, 2021 complete and 0 interrupted iterations
default   [  12% ] 013/400 VUs  01m16.5s/10m30.0s

running (01m34.0s), 013/400 VUs, 2076 complete and 0 interrupted iterations
default   [  12% ] 013/400 VUs  01m17.5s/10m30.0s

running (01m35.0s), 013/400 VUs, 2128 complete and 0 interrupted iterations
default   [  12% ] 013/400 VUs  01m18.5s/10m30.0s

running (01m36.0s), 013/400 VUs, 2182 complete and 0 interrupted iterations
default   [  13% ] 013/400 VUs  01m19.5s/10m30.0s

running (01m37.0s), 013/400 VUs, 2235 complete and 0 interrupted iterations
default   [  13% ] 013/400 VUs  01m20.5s/10m30.0s

running (01m38.0s), 013/400 VUs, 2288 complete and 0 interrupted iterations
default   [  13% ] 013/400 VUs  01m21.5s/10m30.0s

running (01m39.0s), 014/400 VUs, 2342 complete and 0 interrupted iterations
default   [  13% ] 014/400 VUs  01m22.5s/10m30.0s

running (01m40.0s), 014/400 VUs, 2400 complete and 0 interrupted iterations
default   [  13% ] 014/400 VUs  01m23.5s/10m30.0s

running (01m41.0s), 014/400 VUs, 2457 complete and 0 interrupted iterations
default   [  13% ] 014/400 VUs  01m24.5s/10m30.0s

running (01m42.0s), 014/400 VUs, 2513 complete and 0 interrupted iterations
default   [  14% ] 014/400 VUs  01m25.5s/10m30.0s

running (01m43.0s), 014/400 VUs, 2571 complete and 0 interrupted iterations
default   [  14% ] 014/400 VUs  01m26.5s/10m30.0s

running (01m44.0s), 014/400 VUs, 2629 complete and 0 interrupted iterations
default   [  14% ] 014/400 VUs  01m27.5s/10m30.0s

running (01m45.0s), 015/400 VUs, 2686 complete and 0 interrupted iterations
default   [  14% ] 015/400 VUs  01m28.5s/10m30.0s

running (01m46.0s), 015/400 VUs, 2747 complete and 0 interrupted iterations
default   [  14% ] 015/400 VUs  01m29.5s/10m30.0s


  █ THRESHOLDS 

    http_req_duration{name:POST /feeds/{id}/reactions}
    ✓ 'p(99)<3000' p(99)=104.58ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 2779    26.136787/s
    checks_succeeded...: 100.00% 2779 out of 2779
    checks_failed......: 0.00%   0 out of 2779

    ✓ reaction 2xx

    HTTP
    http_req_duration.......................: avg=50.67ms  min=30.69ms  med=42.92ms  max=1.14s    p(90)=57.36ms  p(95)=73.25ms 
      { expected_response:true }............: avg=50.67ms  min=30.69ms  med=42.92ms  max=1.14s    p(90)=57.36ms  p(95)=73.25ms 
      { name:POST /feeds/{id}/reactions }...: avg=45.7ms   min=30.69ms  med=42.76ms  max=273.58ms p(90)=55.57ms  p(95)=64.1ms  
    http_req_failed.........................: 0.00%  0 out of 2830
    http_reqs...............................: 2830   26.616447/s

    EXECUTION
    iteration_duration......................: avg=246.68ms min=231.72ms med=243.74ms max=474.89ms p(90)=256.94ms p(95)=265.82ms
    iterations..............................: 2768   26.033331/s
    vus.....................................: 15     min=0         max=15 
    vus_max.................................: 400    min=400       max=400

    NETWORK
    data_received...........................: 2.6 MB 24 kB/s
    data_sent...............................: 1.2 MB 12 kB/s



running (01m46.3s), 000/400 VUs, 2768 complete and 15 interrupted iterations
default ✗ [  14% ] 014/400 VUs  01m29.9s/10m30.0s
time="2026-08-18T19:19:38+09:00" level=error msg="test run was aborted because k6 received a 'terminated' signal"